#N белочек нашли K орешков и решили разделить их поровну.
# Определите, сколько орешков останется после того, как все белочки возьмут себе равное количество орешков.
squirrel = int(input())
nuts = int(input())
print(nuts % squirrel)