#N белочек нашли K орешков и решили разделить их поровну. Определите, сколько орешков достанется каждой белочке.
squirrel = int(input())
nuts = int(input())
print(nuts // squirrel)